# Opening

Representation of opening in IDEA StatiCa Detail

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.opening import Opening

# TODO update the JSON string below
json = "{}"
# create an instance of Opening from a JSON string
opening_instance = Opening.from_json(json)
# print the JSON string representation of the object
print(Opening.to_json())

# convert the object into a dict
opening_dict = opening_instance.to_dict()
# create an instance of Opening from a dict
opening_from_dict = Opening.from_dict(opening_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)